namespace UnityStudy
{
    internal class Program
    {
        static void Study()
        {
            // if문 > 분기문

            // 반복문

            // while : 하는 동안에
            //while (조건)
            //{// 이 조건이 참인 동안 아래 명령문을 실행 반복해줘
            //}
            // 조건이 변경되지 않는다면 > 값은 달라지지 않을 것
            //int a = 0;
            //while (a < 5) // 조건이 true면 무한루프에 빠져버림
            //{
            //    Console.WriteLine("무한반복");
            //    a++; // 0 > 1 > 2 > 3 > 4 // while문을 쓸때는 반드시 조건변경이 중요하다
            //}
            // 깃허브가 private이라면 : Setting > Change Visuality선택
            /*
             정수변수 num을 1로 초기화한다.
             while문을 이용해 1부터 10까지 출력한다 > 10보다 작거나 같다 , 11 이전
             출력 후 num을 1씩 증가시킨다
             */
            int num = 1; // >> 초기화
            while (num < 11)
            {
                Console.WriteLine(num);
                num++; // 1 > 2 > 3 >> 조건 변경 > 빼먹을 수도 있으니까
                // ++num; // 1 > 2 > 3 > 4 => 아무런 상관이 없다
            }


            // dowhile > 일단 해봐 > 그리고 while 조건이 true면 반복해 : 무조건 한번은 실행이 된다
            //do
            //{
            //    Console.WriteLine(num);
            //    num++; // 항상 조건에 따라 실행되는 것이기 때문에 > 조건에 맞는 횟수로 간다
            //}
            //while (num < 11); // while과 똑같으나, 최초 한번은 무조건 실행된다.

            // for
            //for (초기화(변수); 조건(boolean값); 조건변경(값 변화))
            //{
            Console.WriteLine("aa");
            // for문에서 조건이 비면? > true로 인식 > 전부 비우면( ; ; ) 그냥 무한루프
            //}
            for (int num2 = 1; num2 < 11; ++num2) // while이나 for문이나 똑같다 
            {
                Console.WriteLine(num2);
            }

            for (int n = 0; n < 9; n++)
            {
                Console.WriteLine(n);
                for (int m = 0; m < 9; m++)
                {
                    Console.WriteLine($"{n} {m}"); //CW : Console.WriteLine();
                }

            }
            // 안에 있는 반복문이 먼저 시작해서 > 그 안의 반복문이 그다음 시작됨 > 그리고 안의 반복문이 끝나고 나면 다시 바깥쪽 반복문의 조건변경이 진행
            // 항상 V자로 그린다. >선언 > (조건 > 실행 > 조건변경)(계속 반복)


            // 오늘의 숙제
            // GPT에게 기대지 마라, 남의 코드를 그대로 배끼지 마라 > 스스로 고민하고 배껴라
            // 우리가 하는 것은 작문같은 것이다.
            // 안되면 될때까지 계속 쳐봐라

            //서버만들기 > 유니티 넷코드(유니티의 자체적으로 내장되어있는 서버역할을 하는> 네트워크게임이 가능)
            // >> 예전에는 엄청 안 좋아서 계속 냅둔 걸 > 언리얼에게 밀리자 > 부랴부랴 업그레이드
            //TCP > 서버를 직업 만들어서 > 이건 기본사양 >> 쓰레드에 들어가야하는데 사람마다 이해할 수 있는 능력이 다른데
            // 사람마다 이 흐름을 잘 이해하는 사람이 있으면 잘 안그려지는 사람도 있어서 벽을 느낄 수도 있다.
            // > 재능도 노력을 하면 어떻게든 이해가 될거야
            // 연결은 이렇게 하는거다를 알아야 회사가서 일을 하지
            // 영어 > 문장만드는법도 알아야하고...
            // XR까지 끝나야 네트워트를 배울 예정
            // XR프로그램 / 아나몰픽(꺾여져있는 전광판 튀어나오는) / 네트워크 프로젝트 순이다.

        }
    }
}
