namespace ConsoleApp1
{
    class Program
    {
        static void Main()
        {
            // 구구단 출력 프로그램
            // 앞자리는 2부터 뒷자리는 1부터
            //for (int i = 2; i < 10; i++)
            //{
            //    Console.WriteLine($"{i}단");
            //    for (int j = 1; j < 10; j++)
            //    {
            //        Console.WriteLine($"{i}*{j} = {i * j}");
            //    }
            //}

            // 아직도 중소기업에서는 별짓기가 나온다
            

            // 숙제 하나 더
            // 1에서 10까지 출력하는데 
            // 1은 홀수 입니다
            // 2는 짝수 입니다
            // 어? 근데 한글은 받침의 유무에 따라 은/는으로 나뉘잖아?
            // 일 삼 칠 : 받침 있는 홀수
            // 오 구 : 받침 없는 홀수
            // 이 사 : 받침 없는 짝수 
            // 육 팔 십 : 받침 있는 짝수
            for (int i = 1; i > 11; i++)
            {
                if (i % 2 == 0)
                {
                   Console.WriteLine($"{i}는 짝수입니다");
                }
                else if (i % 2 == 1)
                {
                   Console.WriteLine($"{i}는 홀수입니다.");
                }
            }

            // 누적합 알고리즘 > 1부터 n까지 더해주세요
            // 누적 : 값을 쌓는다 > 최종 결과는 쌓인 값 > 남아있어야 한다 > 스코프 바깥
            // 스코프 '바깥'에 변수선언 및 초기화 > 반복문 속에서 변수에 i값 계속 넣기 > 최종값을 반복문 밖에서 출력

            int save = 0;
            for (int i = 1; i < 11; i++)
            {
                save += i; //save = i + save;
                /*
                 1 - 0 + 1
                 2 - 1 + 2
                 3 - (1+2)+3
                 4 - ((1+2)+3)+4

                 */
            }
            Console.WriteLine(save);

            // 스코프 > 서로 다른 스코프에서 변수는 서로 다른 거 이므로 충돌이 안난다 > 네임스페이스
            // 하지만 스코프 위에 또 스코프가 있고, 거기서 선언한 변수명은 그 아래 스코프에서는 사용이 불가능하다.
            // 스코프 내에 있는 변수의 값은 스코프를 벗어나면 그 값이 사라진다
            

        }
    }
}
